Revit 2024 API
Group.Location Property
This property is used to find the physical location of a group within project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override Location Location { get; }
Visual Basic
Public Overrides ReadOnly Property Location As Location
	Get
Visual C++
public:
virtual property Location^ Location {
	Location^ get () override;
}
Remarks
The Location property returns an object that can be used to find the location of an object within the project. Groups return a point location object.
See Also
Group Class
Autodesk.Revit.DB Namespace